---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsTextOrientation.Horizontal
enum: Autodesk.Revit.DB.Architecture.StairsTextOrientation
source: html/6825f568-2bac-7041-0a48-1cb16713da1a.htm
---
# Autodesk.Revit.DB.Architecture.StairsTextOrientation.Horizontal

Indicator text will be displayed horizontally.